In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("../Temperatures.csv")

In [6]:
df['year']= pd.DatetimeIndex(df['dt']).year

In [7]:
df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,year
0,1980-01-01,0.533,0.650,Afghanistan,1980
1,1980-02-01,2.050,0.473,Afghanistan,1980
2,1980-03-01,8.180,0.235,Afghanistan,1980
3,1980-04-01,17.357,0.200,Afghanistan,1980
4,1980-05-01,21.573,0.319,Afghanistan,1980

In [18]:
df_redidf.groupby(['year','Country'])['AverageTemperature'].max().reset_index()

      year         Country  AverageTemperature
0     1980     Afghanistan              27.457
1     1980          Africa              26.080
2     1980         Albania              22.060
3     1980         Algeria              33.355
4     1980  American Samoa              27.737
...    ...             ...                 ...
8257  2013       W. Sahara              28.564
8258  2013           Yemen              32.325
8259  2013          Zambia              23.636
8260  2013        Zimbabwe              24.075
8261  2013           Åland              16.447

[8262 rows x 3 columns]

In [13]:
df.groupby(['year','Country'])['AverageTemperature'].min().reset_index()

      year         Country  AverageTemperature
0     1980     Afghanistan               0.533
1     1980          Africa              21.039
2     1980         Albania               1.704
3     1980         Algeria              11.111
4     1980  American Samoa              26.394
...    ...             ...                 ...
8257  2013       W. Sahara              17.461
8258  2013           Yemen              21.567
8259  2013          Zambia              18.266
8260  2013        Zimbabwe              17.000
8261  2013           Åland              -4.779

[8262 rows x 3 columns]

In [23]:
df.groupby(['year','Country']).agg({'AverageTemperature': ['mean', 'min', 'max']}).reset_index()

      year         Country AverageTemperature
                                         mean     min     max
0     1980     Afghanistan          14.887333   0.533  27.457
1     1980          Africa          24.446667  21.039  26.080
2     1980         Albania          12.162083   1.704  22.060
3     1980         Algeria          23.160167  11.111  33.355
4     1980  American Samoa          26.990750  26.394  27.737
...    ...             ...                ...     ...     ...
8257  2013       W. Sahara          23.744250  17.461  28.564
8258  2013           Yemen          28.129750  21.567  32.325
8259  2013          Zambia          21.196000  18.266  23.636
8260  2013        Zimbabwe          20.710750  17.000  24.075
8261  2013           Åland           6.229750  -4.779  16.447

[8262 rows x 5 columns]

In [32]:
df_aggre = df.groupby(['year','Country']).agg({'AverageTemperature': ['mean', 'min', 'max']}).reset_index()
df_aggre = df_aggre.set_index(['year','Country'])
df_aggre.columns = df_aggre.columns.droplevel(0)
df_aggre = df_aggre.reset_index()
# tmp.columns = tmp.columns.droplevel(0)

In [35]:
df_aggre.to_csv("tempData Aggregate year and country.csv", encoding='utf-8', index=False)